a = 1  # целое число
a = 1.0  # вещественное число
a = 1 + 1j  # комплексное число
a = True  # улевое значение
a = None  # пустой тип
a = 'hello'  # строка
a = [1, 1.0, 'hello']  # список
a = (1, 1.0, 'hello')  # кортеж
a = {1, 1.0, 'hello'}  # множество
a = frozenset({1, 1.0, 'hello'})  # неизменяемое множество
a = {'a': 1, 'b': 2}  # словарь
a = b'hello'  # байтовый тип
a = bytearray(b'hello')
a = [1, 1.0, 'hello']  # создаем список
help(a)  # выводим информацию об 'a'
print(a) # выводим значение 'a' в консоль
b = input('Введи число')  # консоль выводится сообщение и ожидается когда пользователь введет число
len(a)  # сколько объектов в 'a'
min(a)  # минимальное значение в 'a'
max(a)  # максимальное значение в 'a'
type(a)  # тип объекта  'a'
a = 1
a = 'овое значение переменной a'
some_var: int = 1
other_var: str = 'Hello World'
some_var = 1
other_var = 'Hello World'
5 + 1.1  # 6.1
5 + 'str'  # Ошибка TypeError: unsupported operand type(s) for +: 'int' and 'str'
